# Duct Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Duct Class
Members See Also
---
A duct in the Autodesk Revit MEP product.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Duct : MEPCurve
```

Visual Basic
---
```text
Public Class Duct _
	Inherits MEPCurve
```

Visual C++
---
```text
public ref class Duct : public MEPCurve
```

# Remarks
The duct is only available in the Autodesk Revit MEP product.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB.Mechanical..::..Duct
# See Also
Duct Members
Autodesk.Revit.DB.Mechanical Namespace